In [1]:
import numpy as np
import pandas as pd

In [15]:
colunas = ['user_id', 'age', 'gender', 'occupation', 'zip_code']
usuarios = pd.read_csv('E:\\Projetos Python\\Duplicadas.txt', sep='|', header=None, names=colunas)
#usuarios = pd.read_csv('E:\\Projetos Python\\Duplicadas.txt', sep='|', header=None, names=colunas, index_col='user_id')

usuarios.head(10)

   user_id  age gender  occupation  zip_code
0        1   24      M  technician     85711
1        2   53      F       other     94043
2        3   23      M      writer     32067
3        1   24      M  technician     85711
4        4   24      M  technician     43537
5        5   33      F       other     15213
6        5   33      F       other     15213
7        1   24      M  technician     85711
8        6   53      F       other     43537

In [16]:
#verificando linhas e colunas
usuarios.shape

(9, 5)

In [17]:
#Procurando por CEPs duplicados
usuarios.zip_code.duplicated().head(20)

0    False
1    False
2    False
3     True
4    False
5    False
6     True
7     True
8     True
Name: zip_code, dtype: bool

In [18]:
#como aprendemos, uma serie booleana pode ser convertida em 0 ou 1 automaticamente ao utilizarmos metodos de agregacao
usuarios.zip_code.duplicated().sum()

4

In [19]:
#Verificando se UMA LINHA INTEIRA é duplicada
usuarios.duplicated()

0    False
1    False
2    False
3     True
4    False
5    False
6     True
7     True
8    False
dtype: bool

In [20]:
#Contando as linhas duplicadas
usuarios.duplicated().sum()

3

In [23]:
#Mantendo a primeira linha
usuarios.loc[usuarios.duplicated(keep='first'), :]
#será exibida as linhas duplicadas

   user_id  age gender  occupation  zip_code
3        1   24      M  technician     85711
6        5   33      F       other     15213
7        1   24      M  technician     85711

In [24]:
#Mantendo a ultima linha
usuarios.loc[usuarios.duplicated(keep='last'), :]
#será exibida as linhas duplicadas

   user_id  age gender  occupation  zip_code
0        1   24      M  technician     85711
3        1   24      M  technician     85711
5        5   33      F       other     15213

In [25]:
#Todas as linhas duplicadas
usuarios.loc[usuarios.duplicated(keep=False), :]
#será exibida as linhas duplicadas

   user_id  age gender  occupation  zip_code
0        1   24      M  technician     85711
3        1   24      M  technician     85711
5        5   33      F       other     15213
6        5   33      F       other     15213
7        1   24      M  technician     85711

In [26]:
#Apagando as linhas duplicadas (inplace=False por default) - Shape do dataset que FICOU
usuarios.drop_duplicates(keep='first').shape

(6, 5)

In [27]:
usuarios.drop_duplicates(keep='last').shape

(6, 5)

In [29]:
usuarios.drop_duplicates(keep=False).shape

(4, 5)

# Utilizando um arquivo maior

In [40]:
#read a dataset of movie reviews into a Dataframe
colunas = ['user_id', 'age', 'gender', 'occupation', 'zip_code']
usuarios = pd.read_csv('E:\\Projetos Python\\espectadores.txt', sep='|', header=None, names=colunas, index_col='user_id')
usuarios.head(20)

         age gender     occupation  zip_code
user_id
1         24      M     technician     85711
2         53      F          other     94043
3         23      M     technician     32067
4         24      M         writer     43537
5         33      F     technician    432527
6         42      M          other     15213
7         57      M      executive     98101
8         36      M  administrator     91344
9         20      M  administrator      5201
10        53      M         lawyer     90703
11        39      F          other     30329

In [41]:
#Verificando linhas e colunas
usuarios.shape

(11, 4)

In [42]:
#Procurando por CEPs duplicados
usuarios.zip_code.duplicated().head(20)

user_id
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
Name: zip_code, dtype: bool

In [43]:
#como aprendemos, uma serie booleana pode ser convertida em 0 ou 1 automaticamente ao utilizarmos metodos de agregacao
usuarios.zip_code.duplicated().sum()

0

In [44]:
#contando as linhas duplicadas
usuarios.duplicated().sum()

0

# Regras para o metodo duplicated<br>

<li>
    <ul>keep='first' (default): Marca as linhas duplicadas como TRUE, MENOS a primeira</ul>
    <ul>keep='last': Marca as linhas duplicadas como FALSE, MENOS a ultima ocorrencia</ul>
    <ul>keep=False: Marca todas as linhas duplicadas como True.</ul>
    </li>

In [45]:
#Mantendo a primeira linha
usuarios.loc[usuarios.duplicated(keep='first'), :]
#será exibida as linhas duplicadas

Empty DataFrame
Columns: [age, gender, occupation, zip_code]
Index: []

In [46]:
#Mantendo a ultima linha
usuarios.loc[usuarios.duplicated(keep='last'), :]
#será exibida as linhas duplicadas

Empty DataFrame
Columns: [age, gender, occupation, zip_code]
Index: []

In [47]:
#Todas as linhas duplicadas
usuarios.loc[usuarios.duplicated(keep=False), :]
#será exibida as linhas duplicadas

Empty DataFrame
Columns: [age, gender, occupation, zip_code]
Index: []

# Apagando as linhas duplicadas com drop_duplicated()

In [48]:
#Apagando as linhas duplicadas (inplace=False por default) - Shape do dataset que FICOU
usuarios.drop_duplicates(keep='first').shape

(11, 4)

In [49]:
usuarios.drop_duplicates(keep='last').shape

(11, 4)

In [50]:
usuarios.drop_duplicates(keep=False).shape

(11, 4)

# Podemos considerar apenas algumas colunas para identificar duplicadas?

In [51]:
#Nesse caso, queremos considerar uma linha duplicada somete se a idade e cep forem iguais
usuarios.duplicated(subset=['age', 'zip_code']).sum()

0

In [54]:
usuarios.drop_duplicates(subset=['age', 'zip_code']).shape

(11, 4)